### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # module.api_gateway.aws_apigatewayv2_api.this[0] will be updated in-place
!   resource "aws_apigatewayv2_api" "this" {
!       body                         = <<-EOT
            openapi: '3.0.1'
            info:
              title: Cataprato_http
              version: v1
            paths:
              /register:
                post:
                  summary: Register User
                  operationId: register_user_register_post
                  requestBody:
                    content:
                      application/json:
                        schema:
                          $ref: '#/components/schemas/CreateUser'
                    required: true
                  responses:
                    '200':
                      description: Successful Response
                      content:
                        application/json:
                          schema: {}
                    '422':
                      description: Validation Error
                      content:
                        application/json:
                          schema:
                            $ref: '#/components/schemas/HTTPValidationError'
                  x-amazon-apigateway-integration:
                    payloadFormatVersion: "2.0"
                    uri: "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:authentication/invocations"
                    httpMethod: "POST"
                    type: "aws_proxy"
              /login:
                post:
                  summary: Login
                  operationId: login_auth_post
                  requestBody:
                    content:
                      application/json:
                        schema:
                          $ref: '#/components/schemas/CreateUser'
                    required: true
                  responses:
                    '200':
                      description: Successful Response
                      content:
                        application/json:
                          schema: {}
                    '422':
                      description: Validation Error
                      content:
                        application/json:
                          schema:
                            $ref: '#/components/schemas/HTTPValidationError'
                  x-amazon-apigateway-integration:
                    payloadFormatVersion: "2.0"
                    uri: "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:authentication/invocations"
                    httpMethod: "POST"
                    type: "aws_proxy"
              /health-check:
                get:
                  operationId: AppController_healthCheck
                  parameters: []
                  responses:
                    '200':
                      description: ''
                  x-amazon-apigateway-integration:
                    payloadFormatVersion: "2.0"
                    uri: "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:core/invocations"
                    httpMethod: "POST"
                    type: "aws_proxy"
              /ingredients:
                get:
                  operationId: IngredientsController_findAll
                  parameters: []
                  security:
                  - lambda-authorization: []
                  responses:
                    '200':
                      description: ''
                  x-amazon-apigateway-integration:
                    payloadFormatVersion: "2.0"
                    uri: "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:core/invocations"
                    httpMethod: "POST"
                    type: "aws_proxy"
                post:
                  operationId: IngredientsController_create
                  parameters: []
+                 security:
+                 - lambda-authorization: []
                  requestBody:
                    required: true
                    content:
                      application/json:
                        schema:
                          $ref: '#/components/schemas/CreateIngredientDto'
                  responses:
                    '201':
                      description: ''
                  x-amazon-apigateway-integration:
                    payloadFormatVersion: "2.0"
                    uri: "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:core/invocations"
                    httpMethod: "POST"
                    type: "aws_proxy"
              /ingredients/{id}:
                get:
                  operationId: IngredientsController_findOne
                  security:
                  - lambda-authorization: []
                  parameters:
                    - name: id
                      required: true
                      in: path
                      schema:
                        type: string
                  responses:
                    '200':
                      description: ''
            
                  x-amazon-apigateway-integration:
                    payloadFormatVersion: "2.0"
                    uri: "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:core/invocations"
                    httpMethod: "POST"
                    type: "aws_proxy"
              /recipes:
                get:
                  operationId: RecipeController_findAll
                  parameters: []
                  security:
                  - lambda-authorization: []
                  responses:
                    '200':
                      description: ''
                  x-amazon-apigateway-integration:
                    payloadFormatVersion: "2.0"
                    uri: "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:core/invocations"
                    httpMethod: "POST"
                    type: "aws_proxy"
                post:
                  operationId: RecipeController_create
                  parameters: []
+                 security:
+                 - lambda-authorization: []
                  requestBody:
                    required: true
                    content:
                      application/json:
                        schema:
                          $ref: '#/components/schemas/CreateRecipeDto'
                  responses:
                    '201':
                      description: ''
                  x-amazon-apigateway-integration:
                    payloadFormatVersion: "2.0"
                    uri: "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:core/invocations"
                    httpMethod: "POST"
                    type: "aws_proxy"
              /recipes/{id}:
                get:
                  operationId: RecipeController_findOne
                  security:
                  - lambda-authorization: []
                  parameters:
                    - name: id
                      required: true
                      in: path
                      schema:
                        type: string
                  responses:
                    '200':
                      description: ''
                  x-amazon-apigateway-integration:
                    payloadFormatVersion: "2.0"
                    uri: "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:core/invocations"
                    httpMethod: "POST"
                    type: "aws_proxy"
              /search-recipe:
                get:
                  operationId: SearchRecipeController_getRecipeByIngredients
                  security:
                  - lambda-authorization: []
                  parameters:
                    - name: ingredients
                      required: true
                      in: query
                      description: the IDs of the ingredients to search
                      schema:
                        type: string
                    - name: filters
                      required: false
                      description: Filters to apply in the search
                      in: query
                      schema: {}
                  responses:
                    '200':
                      description: ''
                  x-amazon-apigateway-integration:
                    payloadFormatVersion: "2.0"
                    uri: "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:core/invocations"
                    httpMethod: "POST"
                    type: "aws_proxy"
            components:
              securitySchemes:
                lambda-authorization:
                  type: "apiKey"
                  name: "Authorization"
                  in: "header"
                  x-amazon-apigateway-authorizer:
                    identitySource: "$request.header.Authorization"
                    authorizerUri: "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:authorization/invocations"
                    authorizerPayloadFormatVersion: "2.0"
                    authorizerResultTtlInSeconds: 0
                    type: "request"
                    enableSimpleResponses: true
              schemas:
                CreateUser:
                  properties:
                    email:
                      type: string
                      title: Email
                    password:
                      type: string
                      title: Password
                  type: object
                  required:
                    - email
                    - password
                  title: CreateUser
                HTTPValidationError:
                  properties:
                    detail:
                      items:
                        $ref: '#/components/schemas/ValidationError'
                      type: array
                      title: Detail
                  type: object
                  title: HTTPValidationError
                ValidationError:
                  properties:
                    loc:
                      items:
                        anyOf:
                          - type: string
                          - type: integer
                      type: array
                      title: Location
                    msg:
                      type: string
                      title: Message
                    type:
                      type: string
                      title: Error Type
                  type: object
                  required:
                    - loc
                    - msg
                    - type
                  title: ValidationError
                CreateIngredientDto:
                  type: object
                  properties:
                    name:
                      type: string
                      description: The name of the Ingredient
                  required:
                    - name
                CreateRecipeDto:
                  type: object
                  properties:
                    name:
                      type: string
                      description: The name of the Recipe
                    ingredients:
                      type: string
                      description: The IDs of Ingredients
                    creator:
                      type: string
                      description: the ID of the creator of that recipe
                  required:
                    - name
                    - ingredients
                    - creator
                SearchRecipesFilters:
                  type: object
                  properties: {}
        EOT
        id                           = "qkcy9ocpg8"
!       name                         = "Cataprato_http" -> "cataprato-http"
!       tags                         = {
+           "Deployment" = "terraform"
        }
!       tags_all                     = {
+           "Deployment" = "terraform"
        }
-       version                      = "v1" -> null
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.s3_bucket.aws_s3_bucket.this[0] will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = "public-read"
+       arn                         = (known after apply)
+       bucket                      = "balcony-frontend"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       website {
+           error_document = "error.html"
+           index_document = "index.html"
        }
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created
+   resource "aws_s3_bucket_public_access_block" "this" {
+       block_public_acls       = false
+       block_public_policy     = false
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = false
+       restrict_public_buckets = false
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>